In [1]:
import pandas as pd
import numpy as np

### 1. 데이터 로드

In [2]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [3]:
selloutData.head(1)

  REGIONID   PRODUCT  YEARWEEK   QTY
0      A60  PRODUCT4    201402  71.0

In [4]:
selloutData["NEW_QTY"] = np.where(selloutData["QTY"] < 0, 0, selloutData["QTY"])

In [5]:
### 53주차 제거

In [6]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
NEW_QTY     float64
dtype: object

In [7]:
selloutData["WEEK"] = selloutData["YEARWEEK"]%100

In [8]:
def customFunction(inputColumn):

    #inputColumn = 201601
    yearValue = inputColumn/100
    yearValue = int(yearValue)
    return yearValue

In [9]:
selloutData["YEAR"] = selloutData["YEARWEEK"].apply(customFunction)

In [10]:
selloutData.head(1)

  REGIONID   PRODUCT  YEARWEEK   QTY  NEW_QTY  WEEK  YEAR
0      A60  PRODUCT4    201402  71.0     71.0     2  2014

In [11]:
refinedData = selloutData[selloutData.WEEK < 53]

In [12]:
refinedData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [13]:
sortKey = ["REGIONID","PRODUCT","YEARWEEK"]

In [14]:
sortedData = refinedData.sort_values(sortKey)

In [15]:
sortedData.head()

     REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR
298       A00  PRODUCT34    201401  661.0    661.0     1  2014
1757      A00  PRODUCT34    201402  679.0    679.0     2  2014
3125      A00  PRODUCT34    201403  578.0    578.0     3  2014
205       A00  PRODUCT34    201404  532.0    532.0     4  2014
4369      A00  PRODUCT34    201405  516.0    516.0     5  2014

In [16]:
step1Data = sortedData.reset_index(drop=True)

In [17]:
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR
0      A00  PRODUCT34    201401  661.0    661.0     1  2014
1      A00  PRODUCT34    201402  679.0    679.0     2  2014
2      A00  PRODUCT34    201403  578.0    578.0     3  2014
3      A00  PRODUCT34    201404  532.0    532.0     4  2014
4      A00  PRODUCT34    201405  516.0    516.0     5  2014

### 1. 기본 이동평균 함수

In [18]:
step1Data["SIMPLE_MA"] = step1Data.NEW_QTY.rolling(
    window=13, center=True, min_periods=1).mean()

In [19]:
groupKey = ["REGIONID","PRODUCT","YEAR"]

In [20]:
groupData = step1Data.groupby(groupKey)[["NEW_QTY"]].mean()

In [21]:
groupDataResult = groupData.reset_index()

In [22]:
groupDataResult.head(3)

  REGIONID    PRODUCT  YEAR     NEW_QTY
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923

In [23]:
groupDataResult.columns=["REGIONID","PRODUCT","YEAR","MEAN_QTY"]
groupDataResult.head(2)

  REGIONID    PRODUCT  YEAR    MEAN_QTY
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615

In [24]:
leftData = step1Data
leftData.head(1)

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR   SIMPLE_MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  542.285714

## 데이터 합치기 (속성)

In [25]:
joinKey = ["REGIONID","PRODUCT","YEAR"]

In [26]:
mergedData1 = pd.merge(leftData, groupDataResult, how="left", on=joinKey)

In [27]:
len(leftData)

123864

In [28]:
len(mergedData1)

123864

In [29]:
mergedData1.to_csv("./mergedData2.csv")

In [30]:
groupKey = ["REGIONID","PRODUCT"]

### 그룹바이함수 만들기

In [31]:
#groupDataSet = mergedData1.groupby(groupKey)

In [32]:
def groupRolling(oneGroup):

    #len(list(groupDataSet.groups))

    #oneGroup = groupDataSet.get_group(list(groupDataSet.groups)[2])
    #oneGroup.head(1)

    indexGroupData = oneGroup.reset_index(drop=True)
    indexGroupData["GROUP_MA"] = indexGroupData["NEW_QTY"].rolling(window=13,center=True,min_periods=1).mean()
    
    indexGroupData["GROUP_MEAN"] = indexGroupData["NEW_QTY"].mean()
    return indexGroupData

In [33]:
finalResult = mergedData1.groupby(groupKey).apply(groupRolling)

In [34]:
finalResult2 = finalResult.reset_index(drop=True)

In [35]:
finalResult2.head()

,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,SIMPLE_MA,MEAN_QTY,GROUP_MA,GROUP_MEAN
0,A00,PRODUCT34,201401,661.0,661.0,1,2014,542.285714,275.961538,542.285714,133.057692
1,A00,PRODUCT34,201402,679.0,679.0,2,2014,520.000000,275.961538,520.000000,133.057692
2,A00,PRODUCT34,201403,578.0,578.0,3,2014,514.444444,275.961538,514.444444,133.057692
3,A00,PRODUCT34,201404,532.0,532.0,4,2014,516.800000,275.961538,516.800000,133.057692
4,A00,PRODUCT34,201405,516.0,516.0,5,2014,503.363636,275.961538,503.363636,133.057692

In [36]:
finalResult2["SEASONALITY"] = finalResult2["NEW_QTY"] / finalResult2["GROUP_MA"]

In [37]:
groupKey = ["REGIONID","PRODUCT","WEEK"]

In [38]:
finalResult3 = finalResult2.groupby(groupKey).mean()
finalResult3.head()

                         YEARWEEK         QTY     NEW_QTY  YEAR   SIMPLE_MA  \
REGIONID PRODUCT   WEEK
A00      PRODUCT34 1       201501  277.666667  277.666667  2015  249.018315
                   2       201502  297.333333  297.333333  2015  235.487179
                   3       201503  236.000000  236.000000  2015  229.763533
                   4       201504  238.000000  238.000000  2015  228.651282
                   5       201505  201.333333  201.333333  2015  220.069930

                           MEAN_QTY    GROUP_MA  GROUP_MEAN  SEASONALITY
REGIONID PRODUCT   WEEK
A00      PRODUCT34 1     133.057692  249.018315  133.057692     0.876382
                   2     133.057692  235.487179  133.057692     1.070110
                   3     133.057692  229.763533  133.057692     0.814051
                   4     133.057692  228.651282  133.057692     0.970204
                   5     133.057692  220.069930  133.057692     0.683893

In [39]:
finalResult4 = finalResult3.reset_index()

In [40]:
finalResultOut = finalResult4[["REGIONID","PRODUCT","WEEK","QTY","NEW_QTY","SIMPLE_MA","GROUP_MA","GROUP_MEAN","SEASONALITY"]]

In [41]:
finalResultOut.head()

,REGIONID,PRODUCT,WEEK,QTY,NEW_QTY,SIMPLE_MA,GROUP_MA,GROUP_MEAN,SEASONALITY
0,A00,PRODUCT34,1,277.666667,277.666667,249.018315,249.018315,133.057692,0.876382
1,A00,PRODUCT34,2,297.333333,297.333333,235.487179,235.487179,133.057692,1.070110
2,A00,PRODUCT34,3,236.000000,236.000000,229.763533,229.763533,133.057692,0.814051
3,A00,PRODUCT34,4,238.000000,238.000000,228.651282,228.651282,133.057692,0.970204
4,A00,PRODUCT34,5,201.333333,201.333333,220.069930,220.069930,133.057692,0.683893

In [42]:
finalResultOut.head()

,REGIONID,PRODUCT,WEEK,QTY,NEW_QTY,SIMPLE_MA,GROUP_MA,GROUP_MEAN,SEASONALITY
0,A00,PRODUCT34,1,277.666667,277.666667,249.018315,249.018315,133.057692,0.876382
1,A00,PRODUCT34,2,297.333333,297.333333,235.487179,235.487179,133.057692,1.070110
2,A00,PRODUCT34,3,236.000000,236.000000,229.763533,229.763533,133.057692,0.814051
3,A00,PRODUCT34,4,238.000000,238.000000,228.651282,228.651282,133.057692,0.970204
4,A00,PRODUCT34,5,201.333333,201.333333,220.069930,220.069930,133.057692,0.683893

In [43]:
finalResultOut.to_csv("./seasonality_result.csv")

In [44]:
finalResultOut.columns = finalResultOut.columns.str.lower()

In [45]:
finalResultOut.head()

,regionid,product,week,qty,new_qty,simple_ma,group_ma,group_mean,seasonality
0,A00,PRODUCT34,1,277.666667,277.666667,249.018315,249.018315,133.057692,0.876382
1,A00,PRODUCT34,2,297.333333,297.333333,235.487179,235.487179,133.057692,1.070110
2,A00,PRODUCT34,3,236.000000,236.000000,229.763533,229.763533,133.057692,0.814051
3,A00,PRODUCT34,4,238.000000,238.000000,228.651282,228.651282,133.057692,0.970204
4,A00,PRODUCT34,5,201.333333,201.333333,220.069930,220.069930,133.057692,0.683893

In [46]:
import psycopg2
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('postgresql://haiteam:haiteam@13.209.112.251:5432/postgres') 

resultTable = "project_result"

In [47]:
finalResultOut.to_sql(resultTable, engine, if_exists="replace",index=False)